{
 
  "about": "Hello! I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. ...",
  "about1":"Hey, I want to take you on a small journey on where i come from and what do I believe in. First of all what drives me? I am a child of refugee parents, born and raised in a small village in Italy. Growing up as an immigrant, I quickly realized the immense privilege I had been given and was determined to make the most of this opportunity. In my country, many girls don’t get the chance to study; education is often considered a luxury in the face of widespread poverty. This stark reality fueled my drive to seize every opportunity and eventually help other girls like me realize their full potential.From a young age, I’ve carried a chip on my shoulder, constantly reminded of the unique chance I had to shape my future. My Values? I firmly believe that anything can be learned, and everyone has something valuable to teach there is no hierarchy in learning . This belief stems from my own life experiences. I’ve never considered myself particularly smart or an intuitive learner, but one thing I excel at is perseverance. I know how to keep trying, again and again, until I succeed.This relentless determination has shaped me into the person I am today. I want to share my journey and inspire others, giving them the personal touch of my story to show that with resilience and determination, they too can become the stars they are meant to be. I am also a strong believer of",
  "about_journey": "Hey, I want to take you on a small journey to where I come from and what I believe in. First of all, what drives me?",
  "about_drive":"I am the child of refugee parents, born and raised in a small village in Italy. Growing up as an immigrant, I quickly recognized the immense privilege I had and was determined to make the most of it. In my country, many girls don’t have the chance to study; education is often a luxury amid widespread poverty. This reality fueled my drive to seize every opportunity and help other girls like me realize their full potential. From a young age, I’ve been constantly reminded of the unique chance I have to shape my future.",
  "about_value":" I believe that learning is universal—anyone can learn, and everyone has something valuable to teach. My life experiences have shown me that perseverance is my greatest strength. I’m relentless in my pursuit of success. I don’t define myself by past work, but by what I aim to achieve. Skills can be learned, but character is inherent. My focus is on continuous growth, taking on new challenges, and doing meaningful work.",
  "about_goal":" I want to share my journey and inspire others, giving them the personal touch of my story to show that with resilience and determination, they too can achieve anything they set their mind to.",
  "about_ideal_work":" I thrive in environments surrounded by great minds that challenge my thinking, because that inevitably pushes me to grow and evolve. I love learning and continuously strive to become a better developer, no matter where I am",
  "about_fun_fact":" A small fun fact about me: I have a deep love for photography. Capturing people's emotions and moments through pictures is something I find incredibly fulfilling. Traveling, meeting new people, learning their stories, and being able to capture those moments in a photograph is what truly puts a smile on my face.",
  "about_future":" My future aspirations? In the long term, I aim to create a charitable foundation that provides educational resources and mentorship for underprivileged girls, helping them to unlock their potential and pursue their dreams.",
  "about_end":"I wanted to share a bit about myself to give you a glimpse of who I am, where I come from, and what drives me. I hope this helps you understand my personality, my energy, and the passion I bring to everything I do."
}


