{
 
  "about": "Hello! I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. I don't like to define myself by the work I've done. I define myself by the work I want to do. Skills can be taught but personality is inherent. I prefer to keep learning, continue challenging myself, and do interesting things that matter. ...",
  "about1":"Hey, I want to take you on a small journey on where i come from and what do I believe in. First of all what drives me? I am a child of refugee parents, born and raised in a small village in Italy. Growing up as an immigrant, I quickly realized the immense privilege I had been given and was determined to make the most of this opportunity. In my country, many girls don’t get the chance to study; education is often considered a luxury in the face of widespread poverty. This stark reality fueled my drive to seize every opportunity and eventually help other girls like me realize their full potential.From a young age, I’ve carried a chip on my shoulder, constantly reminded of the unique chance I had to shape my future. My Values? I firmly believe that anything can be learned, and everyone has something valuable to teach there is no hierarchy in learning . This belief stems from my own life experiences. I’ve never considered myself particularly smart or an intuitive learner, but one thing I excel at is perseverance. I know how to keep trying, again and again, until I succeed.This relentless determination has shaped me into the person I am today. I want to share my journey and inspire others, giving them the personal touch of my story to show that with resilience and determination, they too can become the stars they are meant to be. I am also a strong believer of",
  "about2": [
    "Hey, I want to take you on a small journey to where I come from and what I believe in. First of all,",
    "what drives me?",
    "I am a child of refugee parents, born and raised in a small village in Italy. Growing",
    "up as an immigrant, I quickly realized the immense privilege I had been given and was determined",
    "to make the most of this opportunity. In my country, many girls don’t get the chance to study; education",
    "is often considered a luxury in the face of widespread poverty. This stark reality fueled my",
    "drive to seize every opportunity and eventually help other girls like me realize their full potential.",
    "From a young age, I’ve carried a chip on my shoulder, constantly reminded of the unique chance I had",
    "to shape my future.",
    "My values? I firmly believe that anything can be learned, and everyone has something",
    "valuable to teach; there is no hierarchy in learning. This belief stems from my own life experiences.",
    "I’ve never considered myself particularly smart or an intuitive learner, but one thing I excel",
    "at is perseverance. I know how to keep trying, again and again, until I succeed. This relentless",
    "determination has shaped me into the person I am today. I want to share my journey and inspire others,",
    "giving them the personal touch of my story to show that with resilience and determination, they",
    "too can become the stars they are meant to be. I also don't like to define myself by the work I've done;",
    "I define myself by the work I want to do. Skills can be taught, but personality is inherent. I prefer to keep learning,",
    "continue challenging myself, and do interesting things that matter.",
    "What's my ideal work environment? When I am surrounded by great minds that challenge my thinking, because that inevitably makes me grow.",
    "A small fun fact about me: I have a deep love for photography. Capturing people's emotions and moments through pictures",
    "is something I find incredibly fulfilling. Traveling, meeting new people, learning their stories, and being able to",
    "capture those moments in a photograph is what truly puts a smile on my face.",
    "My future aspirations? In the long term aim to create a foundation that provides educational resources and mentorship for underprivileged girls,",
    "helping them to unlock their potential and pursue their dreams.",
    "In this often impersonal world, I wanted to share a little bit about myself, hoping to give you a sense of",
    "the kind of person I am, where I come from, and to help you understand my personality and energy."
  ]
}


