[
  {
    "company": "Full Stack Software Developer",
    "period": "April 2023 - Present",
    "role": "JaguarLandRover",
    "tasks": [
      "Development of tool named Ciara Analyze: Contributed to the creation of an innovative tool designed to analyze vehicle data, enhancing operational efficiency and data-driven decision-making for Jaguar Land Rover",
      "*Front-End Development: created intuitive and responsive frontend interfaces, ensuring a seamless and user-friendly experience with React ",
      "*Back-End Development: developed robust backend solutions using Python to process large datasets stored in MF4 or Roadcast file formats. Leveraged Google Cloud Platform (GCP) for data storage and processing, including integration with GCP buckets and internal databases",
      "*Data Handling: implemented data retrieval based on user-specific requests, such as car model or engine type, to achieve efficient and accurate data access. Utilized Google Cloud Task Queue to handle high volumes of data requests and processing tasks.",
      "*Architectural Contributions: Played a key role in designing and planning the architecture of Ciara Analytics, focusing on scalability, maintainability, and performance. Worked with DevOps teams to implement CI/CD pipelines, containerization with Docker, and cloud deployments, ensuring efficient and reliable delivery of updates and new features.",
      "Data Analysis and Event Detection: Integrated advanced data analysis functionalities to allow users to identify and analyze significant events from the car data logs. Utilized various data visualization libraries to present data in a clear and insightful manner, enabling users to make data-driven decisions."
    ],
    "skills":["Python","React","JavaScript","GCP","AWS","Linux","Shell","CI/CD","Docker","MongoDB"]
  },
  {
    "company": "Perception Software Developer",
    "period": "April 2022 - April 2023",
    "role": "JaguarLandRover",
    "tasks": [
      "Experienced Perception Software Developer with a proven track record in setting up and deploying flashing processes for ORIN Devkits",
      "*Skilled in automating flashing processes of ECUs and Devkits using GitLab CI/CD pipeline, ensuring efficient and reliable deployment",
      "*Proven ability in creating and implementing Key Performance Indicators (KPIs) for lane detection, resulting in improved accuracy and performance",
      "*Demonstrated expertise in integrating Nvidia software and deploying it within JLR, effectively enhancing overall system performance",
      "*Proficient in collecting and analyzing both vehicle and ground truth data, demonstrating a strong understanding of computer vision and perception techniques",
      "*Proficient in sensor model design, with experience in creating a software-in-the-loop (SIL) environment using RoadRunner for software bug detection"
    ],
     "skills":["Python","Shell","CI/CD","Docker","Linux"]
  },
  {
    "company": "Embedded Software Developer",
    "period": "Sept 2017 - April 2022",
    "role": "JaguarLandRover",
    "tasks": [
      "Developed an application using OOP concepts in Matlab and Python for converting and manipulating vehicle data from MF4 format",
      "Implemented a surface friction model in Simulink to detect the slip of the vehicle, which is now being utilized in Defender, Range Rover, and Range Rover Sport and it has been filed for patent ",
      "Experienced in vehicle testing of simulated systems using CANape, CANoe, and CANalyzer and their interaction with ECUs",
      "Proficient in MIL & SIL Simulations and Diagnostic simulations,Expertise in designing model-based and software systems using MATLAB and Simulink",
      "Calculated friction conditions for Intelligent Driveline Dynamic (IDD) Systems,Replaced pressure-sensing models (CVD) with a bespoke IMU capability,Interfaced Inertial Measurement Units (IMU) to estimate vehicle terrain conditions"
    ],
    "skills":["Matlab","Simulink","SIL","MIL","CANape","CANalyzer","CANoe"]
  },
  {
    "company": "Embedded Software Developer",
    "period": "Sept 2016 - Sept 2017",
    "role": "Lufthansa",
    "tasks": [
      "Worked on Airbus A32F, A340 and Boeing 737:",
      "*Systematic research into aircraft maintenance for capability, material and tooling",
      "*Work with technicians on incoming defects and engineering orders",
      "*Compiling detailed technical reports to obtain and confirm repair schemes",
      "*Investigation and completion of technical issues in accordance with guidelines"
    ],
    "skills":["Python","React","JavaScript"]
  }
]
